kauailabs/navxmxp/stm32/MPU9250/mpucontroller.cpp
/* ============================================
navX MXP source code is placed under the MIT license
Copyright (c) 2015 Kauai Labs

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in
all copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
THE SOFTWARE.
===============================================
*/

#include "mpucontroller.h"
#include "stm32_shim.h"
#include "usb_serial.h"
#include <math.h>
#include "helper_3dmath.h"

extern "C" {
#include "mpl.h"
#include "inv_mpu.h"
#include "inv_mpu_dmp_motion_driver.h"
#include "invensense.h"
#include "mltypes.h"
#include "invensense_adv.h"
#include "eMPL_outputs.h"
#include "stm32f4xx_hal.h"
}
#include <stdio.h>
#define PEDO_READ_MS    (1000)

#define ACCEL_ON        (0x01)
#define GYRO_ON         (0x02)
#define COMPASS_ON      (0x04)

extern I2C_HandleTypeDef hi2c2;

int _MLPrintLog(int priority, const char *tag, const char *fmt, ...) { return 0; }

/******************************************************
 * DMP
 *****************************************************/

struct hal_s {
    unsigned char lp_accel_mode;
    unsigned char sensors;
    unsigned char dmp_on;
    unsigned char wait_for_tap;
    volatile unsigned char new_gyro;
    unsigned char motion_int_mode;
    unsigned long no_dmp_hz;
    unsigned long next_pedo_ms;
    unsigned long next_temp_ms;
    unsigned long next_compass_ms;
    unsigned int report;
    unsigned short dmp_features;
};
static struct hal_s hal = {0};
struct mag_calibration_data magcaldata;

/* Platform-specific information. Kinda like a boardfile. */
struct platform_data_s {
    signed char orientation[9];
};

/* The sensors can be mounted onto the board in any orientation. The mounting
 * matrix seen below tells the MPL how to rotate the raw data from the
 * driver(s).
 */
static struct platform_data_s gyro_pdata = {
    { 1, 0, 0,
      0, 1, 0,
      0, 0, 1}
};

static struct platform_data_s compass_pdata = {
    { 0, 1, 0,
      1, 0, 0,
      0, 0,-1}
};
#define COMPASS_ENABLED 1
unsigned char *mpl_key = (unsigned char*)"eMPL 5.1";

static const int16_t default_magcal_bias = 0;
static const float default_magcal_xform = 1.0f;
/* By default, set the norm of the earth's mag field to a small value. */
/* This effectively results in constant disturbance detection, which   */
/* is appropriate since the disturbance detection algorithm cannot     */
/* be trusted until the magnetometer has been calibrated.              */
static const float default_magcal_earth_mag_field_norm = 1.0f;
static const float default_magcal_magdisturbance_ratio = 0.19f; /* Empirically-determined default */

float yaw_at_last_new_compass_heading = 0.0f;
float last_new_compass_heading = 0.0f;
float last_valid_fused_heading = 0.0f;
float yaw_at_last_valid_fused_heading = 0.0f;
float compass_heading_noise_band_degrees = 2.0f;
bool first_valid_fused_heading_detected = false;
int valid_fused_header_count = 0;

_EXTERN_ATTRIB bool is_mag_cal_data_default( struct mag_calibration_data *magcaldata )
{
	bool is_default = true;
	for ( size_t i = 0; i < sizeof(magcaldata->bias)/sizeof(magcaldata->bias[0]); i++ ) {
		if ( magcaldata->bias[i] != default_magcal_bias ) {
			is_default = false;
		}
	}
	for ( int x = 0; x < 3; x++ ) {
		for ( int y = 0; y < 3; y++ ) {
			if ( magcaldata->xform[x][y] != default_magcal_xform ) {
				is_default = false;
			}
		}
	}
	if ( magcaldata->earth_mag_field_norm != default_magcal_earth_mag_field_norm ) {
		is_default = false;
	}
	if ( magcaldata->mag_disturbance_ratio != default_magcal_magdisturbance_ratio ) {
		is_default = false;
	}
	return is_default;
}

_EXTERN_ATTRIB void get_default_mag_cal_data(struct mag_calibration_data *magcaldata)
{
	for ( size_t i = 0; i < sizeof(magcaldata->bias)/sizeof(magcaldata->bias[0]); i++ ) {
		magcaldata->bias[i] = default_magcal_bias;
	}
	for ( int x = 0; x < 3; x++ ) {
		for ( int y = 0; y < 3; y++ ) {
			magcaldata->xform[x][y] = default_magcal_xform;
		}
	}
	magcaldata->earth_mag_field_norm = default_magcal_earth_mag_field_norm;
	magcaldata->mag_disturbance_ratio = default_magcal_magdisturbance_ratio;
}

_EXTERN_ATTRIB void mpu_apply_mag_cal_data(struct mag_calibration_data *caldata) {
	memcpy(&magcaldata,caldata,sizeof(magcaldata));
	/* Reset the fused heading tracking variables */
	last_new_compass_heading = 0.0f;
	last_valid_fused_heading = 0.0f;
	yaw_at_last_valid_fused_heading = 0.0f;
	first_valid_fused_heading_detected = false;
	valid_fused_header_count = 0;
}

_EXTERN_ATTRIB void mpu_get_mag_cal_data(struct mag_calibration_data *caldata) {
	memcpy(caldata, &magcaldata, sizeof(magcaldata));
}

/* Every time new gyro data is available, this function is called in an
 * ISR context. In this example, it sets a flag protecting the FIFO read
 * function.
 */
static void gyro_data_ready_cb(void)
{
    hal.new_gyro = 1;
}

/* This function is invoked by core/driver/stm32L/log_stm32.c */

_EXTERN_ATTRIB void fputchar( char *string)
{
}

static void tap_cb(unsigned char direction, unsigned char count)
{
    switch (direction) {
    case TAP_X_UP:
        break;
    case TAP_X_DOWN:
        break;
    case TAP_Y_UP:
        break;
    case TAP_Y_DOWN:
        break;
    case TAP_Z_UP:
        break;
    case TAP_Z_DOWN:
        break;
    default:
        return;
    }
    return;
}

static void android_orient_cb(unsigned char orientation)
{
	switch (orientation) {
	case ANDROID_ORIENT_PORTRAIT:
        break;
	case ANDROID_ORIENT_LANDSCAPE:
        break;
	case ANDROID_ORIENT_REVERSE_PORTRAIT:
        break;
	case ANDROID_ORIENT_REVERSE_LANDSCAPE:
        break;
	default:
		return;
	}
}

unsigned long timestamp = 0;
unsigned long sensor_timestamp = 0;
unsigned char accel_fsr = 0;

_EXTERN_ATTRIB void mpu_initialize(unsigned short mpu_interrupt_pin)
{
    inv_error_t result;
    unsigned short gyro_rate, gyro_fsr;
     struct int_param_s int_param;

#ifdef COMPASS_ENABLED
    unsigned short compass_fsr;
    get_default_mag_cal_data(&magcaldata);
#endif

    /* Set up gyro.
     * Every function preceded by mpu_ is a driver function and can be found
     * in inv_mpu.h.
     */
    int_param.cb = gyro_data_ready_cb;
    int_param.pin = mpu_interrupt_pin;
    result = mpu_init(&int_param);
    if (result) {
        /* Reset */
    }

