kauailabs/navxmxp/stm32/MPU9250/mpucontroller.cpp
    /* Enable Interrupts */
}

_EXTERN_ATTRIB void get_mpu_config(struct mpu_config *pconfig)
{
	dmp_get_fifo_rate(&pconfig->mpu_update_rate);
    mpu_get_gyro_fsr(&pconfig->gyro_fsr);
    mpu_get_accel_fsr(&pconfig->accel_fsr);
}

_EXTERN_ATTRIB int run_mpu_self_test(struct mpu_selftest_calibration_data *caldata)
{
    int result;
    int i;
    long gyro[3], accel[3];

#if defined (MPU6500) || defined (MPU9250)
    result = mpu_run_6500_self_test(gyro, accel, 0);
#elif defined (MPU6050) || defined (MPU9150)
    result = mpu_run_self_test(gyro, accel);
#endif
    if (result == 0x7) {
        /* Test passed. We can trust the gyro data here, so now we need to update calibrated data*/
        for ( i=0; i < 3; i++ ) {
        	caldata->accel_bias[i] = accel[i];
        	caldata->gyro_bias[i]  = gyro[i];
		}
    	mpu_get_accel_sens(&caldata->accel_sensitivity);
    	mpu_get_gyro_sens(&caldata->gyro_sensitivity);

    }
	return result;
}

_EXTERN_ATTRIB void enable_dmp()
{
	if ( hal.dmp_on ) return;

	unsigned short sample_rate;
	hal.dmp_on = 1;
	/* Preserve current FIFO rate. */
	mpu_get_sample_rate(&sample_rate);
	dmp_set_fifo_rate(sample_rate);
	inv_set_quat_sample_rate(1000000L / sample_rate);
	mpu_set_dmp_state(1);
	MPL_LOGI("DMP enabled.\n");
}
//#define USE_CAL_MPU_REGISTERS
_EXTERN_ATTRIB int mpu_apply_calibration_data(struct mpu_selftest_calibration_data *caldata)
{
	long gyro[3], accel[3];

#ifdef USE_CAL_MPU_REGISTERS
        /*
         * This portion of the code uses the HW offset registers that are in the MPUxxxx devices
         * instead of pushing the cal data to the MPL software library
         * These values must be in h/w units, an w/a 1000dps gyro / 8G accel scale
         */
        unsigned char i = 0;

        for(i = 0; i<3; i++) {
        	gyro[i] = (long)(caldata->gyro_bias[i] * 32.8f); //convert to +-1000dps (2000dps?)
        	gyro[i] = (long)(gyro[i] >> 16);
        	accel[i] = caldata->accel_bias[i];
        	accel[i] *= 4096.f; //convert to +-8G Scott Libert, 11/26/2014: Data sheet says +- 16G! (2G?)
        	accel[i] = accel[i] >> 16;
         }

        //mpu_set_gyro_bias_reg(gyro);

#if defined (MPU6500) || defined (MPU9250)
        mpu_set_accel_bias_6500_reg(accel);
#elif defined (MPU6050) || defined (MPU9150)
        mpu_set_accel_bias_6050_reg(accel);
#endif

#elif defined (USE_CAL_DMP_REGISTERS)
        float sens;
        unsigned short accel_sens;
        mpu_get_gyro_sens(&sens);
        gyro[0] = (long)(caldata->gyro_bias[0] * sens);
        gyro[1] = (long)(caldata->gyro_bias[1] * sens);
        gyro[2] = (long)(caldata->gyro_bias[2] * sens);
        dmp_set_gyro_bias(gyro);
        mpu_get_accel_sens(&accel_sens);
        accel[0] = (long)(caldata->accel_bias[0] *accel_sens);
        accel[1] = (long)(caldata->accel_bias[1] *accel_sens);
        accel[2] = (long)(caldata->accel_bias[2] *accel_sens);
        dmp_set_accel_bias(accel);
#else  /* !USE_CAL_HW_REGISTERS */

        /* Push the calibration biases to the MPL Library. These biases are */
        /* in h/w units, but * 2<<16                                        */

		accel[0] = caldata->accel_bias[0] * caldata->accel_sensitivity;
		accel[1] = caldata->accel_bias[1] * caldata->accel_sensitivity;
		accel[2] = caldata->accel_bias[2] * caldata->accel_sensitivity;
		inv_set_accel_bias(accel, 3);
		gyro[0] = (long) (caldata->gyro_bias[0] * caldata->gyro_sensitivity);
		gyro[1] = (long) (caldata->gyro_bias[1] * caldata->gyro_sensitivity);
		gyro[2] = (long) (caldata->gyro_bias[2] * caldata->gyro_sensitivity);
		inv_set_gyro_bias(gyro, 3);
#endif /* USE_CAL_HW_REGISTERS */
		return 0;
}

#define PI 3.1415926f
const float radians_to_degrees = 180.0 / M_PI;

_EXTERN_ATTRIB int dmp_data_ready()
{
	return hal.new_gyro;
}

struct FloatVectorStruct {
  float x;
  float y;
  float z;
};

void getEuler(float *data, Quaternion *q) {

    data[0] = atan2(2*q -> x*q -> y - 2*q -> w*q -> z, 2*q -> w*q -> w + 2*q -> x*q -> x - 1);   // psi
    data[1] = -asin(2*q -> x*q -> z + 2*q -> w*q -> y);                              // theta
    data[2] = atan2(2*q -> y*q -> z - 2*q -> w*q -> x, 2*q -> w*q -> w + 2*q -> z*q -> z - 1);   // phi
}

void getGravity(struct FloatVectorStruct *v, Quaternion *q) {

    v -> x = 2 * (q -> x*q -> z - q -> w*q -> y);
    v -> y = 2 * (q -> w*q -> x + q -> y*q -> z);
    v -> z = q -> w*q -> w - q -> x*q -> x - q -> y*q -> y + q -> z*q -> z;
}

void dmpGetYawPitchRoll(float *data, Quaternion *q, struct FloatVectorStruct *gravity) {

    // yaw: (about Z axis)
    data[0] = atan2(2*q -> x*q -> y - 2*q -> w*q -> z, 2*q -> w*q -> w + 2*q -> x*q -> x - 1);
    // pitch: (nose up/down, about Y axis)
    data[1] = atan(gravity -> x / sqrt(gravity -> y*gravity -> y + gravity -> z*gravity -> z));
    // roll: (tilt left/right, about X axis)
    data[2] = atan(gravity -> y / sqrt(gravity -> x*gravity -> x + gravity -> z*gravity -> z));
}

#ifdef COMPASS_ENABLED
    short compass_short[3];
#endif
long last_temperature = 32 * 65535; /* Reasonable default */
long compass_accumulator[3] = {0,0,0};
long compass_accumulator_count = 0;
unsigned long next_compass_ms = 0;
#define COMPASS_SAMPLE_PERIOD_MS ((unsigned long)10)
int new_compass = 0;
int new_temp = 0;
int new_data = 0;

_EXTERN_ATTRIB int periodic_compass_update() {
	short new_compass_data_short[3];
	int ret = 0;
	unsigned long curr_timestamp = HAL_GetTick();

	/* Read compass data if sufficient time has passed. */
	if (curr_timestamp > next_compass_ms) {
		next_compass_ms = curr_timestamp + COMPASS_SAMPLE_PERIOD_MS;

		ret = mpu_get_compass_reg(new_compass_data_short, &curr_timestamp);
		if (!ret) {
			compass_accumulator[0] += new_compass_data_short[0];
			compass_accumulator[1] += new_compass_data_short[1];
			compass_accumulator[2] += new_compass_data_short[2];
			compass_accumulator_count++;
		}
	}
	return ret;
}

_EXTERN_ATTRIB int get_dmp_data( struct mpu_data *pdata )
{
    short gyro[3], accel_short[3];
    FloatVectorStruct gravity;
    short sensors;
    unsigned char more;
    unsigned long sensor_timestamp;
    long accel[3];
    if ( !hal.new_gyro ) return -1;
    if ( NULL == pdata ) return -1;

    get_ms(&timestamp);

    if (!dmp_read_fifo(gyro, accel_short, pdata->quaternion, &sensor_timestamp, &sensors, &more) ) {

