kauailabs/navxmxp/stm32/MPU9250/mpucontroller.cpp
    	/* Read mpu temperature data if sufficient time has passed. */
		if (timestamp > hal.next_temp_ms) {
			hal.next_temp_ms = timestamp + TEMP_READ_MS;
			new_temp = 1;
		}

#ifdef COMPASS_ENABLED
		/* Due to compass noise, average each sample (period = COMPASS_READ_MS) */
		if ((timestamp > hal.next_compass_ms) && !hal.lp_accel_mode &&
			hal.new_gyro && (hal.sensors & COMPASS_ON)) {
			hal.next_compass_ms = timestamp + COMPASS_READ_MS;
			new_compass = 1;
		}
#endif

		if ( !more ) {
			hal.new_gyro = 0;
		}

		if (sensors & INV_XYZ_GYRO) {
			new_data = 1;
			if (new_temp) {
				new_temp = 0;
				mpu_get_temperature(&last_temperature, &sensor_timestamp);
				/* Correct for discrepancy between datasheet and mpu_get_temperature implementation */
				last_temperature -= (14 * 65536);
				pdata->temp_c = last_temperature / 65536.0;
			}
		}
		if (sensors & INV_XYZ_ACCEL) {
			accel[0] = (long)accel_short[0];
			accel[1] = (long)accel_short[1];
			accel[2] = (long)accel_short[2];
			new_data = 1;
		}
		if (sensors & INV_WXYZ_QUAT) {
			new_data = 1;
		}

#ifdef COMPASS_ENABLED
		periodic_compass_update();
		if (new_compass && ( compass_accumulator_count > 0 )) {
			long compass[3];
			compass[0] = (compass_accumulator[0] / compass_accumulator_count);
			compass[1] = (compass_accumulator[1] / compass_accumulator_count);
			compass[2] = (compass_accumulator[2] / compass_accumulator_count);

			compass_short[0] = (short)compass[0];
			compass_short[1] = (short)compass[1];
			compass_short[2] = (short)compass[2];
			/* Reset accumulator */
			compass_accumulator_count = 0;
			compass_accumulator[0] = 0;
			compass_accumulator[1] = 0;
			compass_accumulator[2] = 0;

			new_data = 1;
		}
#endif

		if ( new_data ) {
			 //inv_execute_on_data();
			/* This function reads bias-compensated sensor data and sensor
			 * fusion outputs from the MPL. The outputs are formatted as seen
			 * in eMPL_outputs.c. This function only needs to be called at the
			 * rate requested by the host.
			 */
			float ypr[3];
			Quaternion q( (float)(pdata->quaternion[0] >> 16) / 16384.0f,
						  (float)(pdata->quaternion[1] >> 16) / 16384.0f,
						  (float)(pdata->quaternion[2] >> 16) / 16384.0f,
						  (float)(pdata->quaternion[3] >> 16) / 16384.0f);

			getGravity(&gravity, &q);
			dmpGetYawPitchRoll(ypr, &q, &gravity);

			pdata->yaw = ypr[0] * radians_to_degrees;
			pdata->pitch = ypr[1] * radians_to_degrees;
			pdata->roll = ypr[2] * radians_to_degrees;

	        pdata->world_linear_accel[0] = (((float)accel_short[0]) / (32768.0 / accel_fsr)) - gravity.x;
	        pdata->world_linear_accel[1] = (((float)accel_short[1]) / (32768.0 / accel_fsr)) - gravity.y;
	        pdata->world_linear_accel[2] = (((float)accel_short[2]) / (32768.0 / accel_fsr)) - gravity.z;

	        float q1[4];
	        float q2[4];
	        float q_product[4];
	        float q_conjugate[4];
	        float q_final[4];

	        // Calculate world-frame acceleration

	        q1[0] = q.w;
	        q1[1] = q.x;
	        q1[2] = q.y;
	        q1[3] = q.z;

	        q2[0] = 0;
	        q2[1] = pdata->world_linear_accel[0];
	        q2[2] = pdata->world_linear_accel[1];
	        q2[3] = pdata->world_linear_accel[2];

	        // Rotate linear acceleration so that it's relative to the world reference frame

	        // http://www.cprogramming.com/tutorial/3d/quaternions.html
	        // http://www.euclideanspace.com/maths/algebra/realNormedAlgebra/quaternions/transforms/index.htm
	        // http://content.gpwiki.org/index.php/OpenGL:Tutorials:Using_Quaternions_to_represent_rotation
	        // ^ or: http://webcache.googleusercontent.com/search?q=cache:xgJAp3bDNhQJ:content.gpwiki.org/index.php/OpenGL:Tutorials:Using_Quaternions_to_represent_rotation&hl=en&gl=us&strip=1

	        // P_out = q * P_in * conj(q)
	        // - P_out is the output vector
	        // - q is the orientation quaternion
	        // - P_in is the input vector (a*aReal)
	        // - conj(q) is the conjugate of the orientation quaternion (q=[w,x,y,z], q*=[w,-x,-y,-z])

	        // calculate quaternion product
	        // Quaternion multiplication is defined by:
	        //     (Q1 * Q2).w = (w1w2 - x1x2 - y1y2 - z1z2)
	        //     (Q1 * Q2).x = (w1x2 + x1w2 + y1z2 - z1y2)
	        //     (Q1 * Q2).y = (w1y2 - x1z2 + y1w2 + z1x2)
	        //     (Q1 * Q2).z = (w1z2 + x1y2 - y1x2 + z1w2

	        q_product[0] = q1[0]*q2[0] - q1[1]*q2[1] - q1[2]*q2[2] - q1[3]*q2[3];  // new w
	        q_product[1] = q1[0]*q2[1] + q1[1]*q2[0] + q1[2]*q2[3] - q1[3]*q2[2];  // new x
	        q_product[2] = q1[0]*q2[2] - q1[1]*q2[3] + q1[2]*q2[0] + q1[3]*q2[1];  // new y
	        q_product[3] = q1[0]*q2[3] + q1[1]*q2[2] - q1[2]*q2[1] + q1[3]*q2[0];  // new z

	        q_conjugate[0] = q1[0];
	        q_conjugate[1] = -q1[1];
	        q_conjugate[2] = -q1[2];
	        q_conjugate[3] = -q1[3];

	        q_final[0] = q_product[0]*q_conjugate[0] - q_product[1]*q_conjugate[1] - q_product[2]*q_conjugate[2] - q_product[3]*q_conjugate[3];  // new w
	        q_final[1] = q_product[0]*q_conjugate[1] + q_product[1]*q_conjugate[0] + q_product[2]*q_conjugate[3] - q_product[3]*q_conjugate[2];  // new x
	        q_final[2] = q_product[0]*q_conjugate[2] - q_product[1]*q_conjugate[3] + q_product[2]*q_conjugate[0] + q_product[3]*q_conjugate[1];  // new y
	        q_final[3] = q_product[0]*q_conjugate[3] + q_product[1]*q_conjugate[2] - q_product[2]*q_conjugate[1] + q_product[3]*q_conjugate[0];  // new z

	        /* At this point, linear acceleration is in world frame */

	        pdata->world_linear_accel[0] = q_final[1];
	        pdata->world_linear_accel[1] = q_final[2];
	        pdata->world_linear_accel[2] = q_final[3];

	    	float mag_field[3];

	    	/* Note:  X/Y are swapped, and z is inverted, see compass orientation matrix */
	    	pdata->raw_compass[0] = compass_short[1];
	    	pdata->raw_compass[1] = compass_short[0];
	    	pdata->raw_compass[2] = -compass_short[2];

			/* Apply compass calibration biases */
	    	mag_field[0] = pdata->raw_compass[0] - magcaldata.bias[0];
	    	mag_field[1] = pdata->raw_compass[1] - magcaldata.bias[1];
	    	mag_field[2] = pdata->raw_compass[2] - magcaldata.bias[2];

			/* Determine whether the current magnetometer reading differs the norm of the earth's */
	    	/* magnetic field by more than the disturbance ratio.  In this case, a magnetic       */
	    	/* anomaly is declared.                                                               */
			float mag_field_norm = (float)sqrt( ( mag_field[0] * mag_field[0] ) +
					( mag_field[1] * mag_field[1] ) +
					( mag_field[2] * mag_field[2] ) );

			float mag_field_difference_from_norm = fabs(mag_field_norm - magcaldata.earth_mag_field_norm );
			pdata->ratio_of_mag_field_norm = mag_field_difference_from_norm / fabs(magcaldata.earth_mag_field_norm);
			if ( pdata->ratio_of_mag_field_norm > magcaldata.mag_disturbance_ratio ) {
				pdata->magnetic_anomaly_detected = true;
			} else {
				pdata->magnetic_anomaly_detected = false;
			}

