kauailabs/navxmxp/stm32/MPU9250/mpucontroller.cpp
			/* Correct for soft iron distortion with the calibration matrix */
	    	pdata->calibrated_compass[0] = 0.0;
	    	pdata->calibrated_compass[1] = 0.0;
	    	pdata->calibrated_compass[2] = 0.0;
			for (int i=0; i<3; ++i)
				for (int j=0; j<3; ++j)
					pdata->calibrated_compass[i] += (magcaldata.xform[i][j] * mag_field[j]);

			/* Stabilize the radius of the sphere by multiplying by the ratio from the norm. */
			pdata->mag_norm_scalar = magcaldata.earth_mag_field_norm/mag_field_norm;
			//apply the current scaler to the calibrated coordinates (global array calibrated_values)
			pdata->calibrated_compass[0] *= pdata->mag_norm_scalar;
			pdata->calibrated_compass[1] *= pdata->mag_norm_scalar;
			pdata->calibrated_compass[2] *= pdata->mag_norm_scalar;

	    	// Correct for when signs are reversed.
	    	//if(heading_radians < 0)
	    	//	heading_radians += 2*PI;

	    	/* Perform tilt compensation, based upon pitch/roll */
            float inverted_pitch = -ypr[1];
            float roll = ypr[2];

            float cos_roll = cos(roll);
            float sin_roll = sin(roll);
            float cos_pitch = cos(inverted_pitch);
            float sin_pitch = sin(inverted_pitch);

            float MAG_X = pdata->calibrated_compass[0] * cos_pitch + pdata->calibrated_compass[2] * sin_pitch;
            float MAG_Y = pdata->calibrated_compass[0] * sin_roll * sin_pitch + pdata->calibrated_compass[1] * cos_roll - pdata->calibrated_compass[2] * sin_roll * cos_pitch;
            float tilt_compensated_heading_radians = atan2(MAG_Y,MAG_X);
	    	pdata->heading = tilt_compensated_heading_radians * radians_to_degrees;

	    	/* If new compass heading differs by more than the yaw delta since the last update, */
	    	/* (adding in a margin for the understood compass noise bandwidth), then declare a  */
	    	/* Magnetic anomaly.                                                                */

	    	bool interpolate_fused_heading = true;
	    	if ( new_compass ) {
	    		float compass_delta = fabs(pdata->heading - last_new_compass_heading);
	    		float yaw_delta = fabs(pdata->yaw - yaw_at_last_new_compass_heading);
	    		if ( first_valid_fused_heading_detected &&
	    		     ( compass_delta > (yaw_delta + compass_heading_noise_band_degrees) ) ) {
	    			pdata->magnetic_anomaly_detected = true;
	    		}

				/* Interpolate the fused heading, deriving it from the compass and gyro    */
				/* data, ignoring the compass heading when magnetic anomalies are detected */
				/* and interpolating values in-between compass heading updates.            */
				/* TODO:  Ignore updates from yaw until gyro has been calibrated?          */
				/* Only declare new compass readings valid if rotation less than the       */
				/* compass noise band has occurred.                                        */

	    		if ( ( !pdata->magnetic_anomaly_detected ) &&
	    		     ( yaw_delta < compass_heading_noise_band_degrees ) ) {
	    			valid_fused_header_count++;
	    			if ( valid_fused_header_count >= 3 ) {
						first_valid_fused_heading_detected = true;
						pdata->fused_heading =
							last_valid_fused_heading = pdata->heading;
							yaw_at_last_valid_fused_heading = pdata->yaw;
						interpolate_fused_heading = false;
	    			}
	    		} else {
	    			valid_fused_header_count = 0;
	    		}
				new_compass = 0;
				yaw_at_last_new_compass_heading = pdata->yaw;
				last_new_compass_heading = pdata->heading;
	    	}

	    	if ( interpolate_fused_heading ) {
	    		/* Interpolate fused heading based upon change in gyro yaw */
	    		pdata->fused_heading = last_valid_fused_heading + (pdata->yaw - yaw_at_last_valid_fused_heading);
	    	}

	        /* Modify compass heading ranges from -180-180 to 0-360 degrees */
	        if ( pdata->heading < 0 ) {
	        	pdata->heading += 360;
	        }
	        /* Fused heading possible ranges are Modify 0 (compass) + -180 [-180] */
	        /* to 360 + 180 (540).  Modify the range to be 0-360 degrees.         */
	        if ( pdata->fused_heading < 0 ) {
	        	pdata->fused_heading += 360;
	        } else if ( pdata->fused_heading > 360 ) {
	        	pdata->fused_heading -= 360;
	        }
			pdata->fused_heading_valid = first_valid_fused_heading_detected;

	    	pdata->calibrated_gyro_x = gyro[0];
	    	pdata->calibrated_gyro_y = gyro[1];
	    	pdata->calibrated_gyro_z = gyro[2];

	    	pdata->raw_gyro[0] = gyro[0];
	    	pdata->raw_gyro[1] = gyro[1];
	    	pdata->raw_gyro[2] = gyro[2];

	    	pdata->raw_accel[0] = accel_short[0];
	    	pdata->raw_accel[1] = accel_short[1];
	    	pdata->raw_accel[2] = accel_short[2];
		}
		return 0;
	} else {
		/* Error communicating with MPU.  Clear the new data received flag. */
		hal.new_gyro = 0;
		return -1;
	}
}

/* The following #defines were copied from inv_dmp_motion_driver.c */
/* This is a hack, but allows ensure we dont' have to modify the   */
/* source code of the Invensense driver.                           */

#define D_EXT_GYRO_BIAS_X       (61 * 16)			// 12 bytes
#define D_EXT_GYRO_BIAS_Y       (61 * 16) + 4
#define D_EXT_GYRO_BIAS_Z       (61 * 16) + 8

uint8_t last_dmp_gyro_bias[12] = {0,0,0,0,0,0,0,0,0,0,0,0};

_EXTERN_ATTRIB int mpu_did_dmp_gyro_biases_change(struct mpu_dmp_calibration_data *dmpcaldata) {
	uint8_t curr_dmp_gyro_bias[12];
	int gyro_bias_cmp;
	int changed = 0;
	mpu_read_mem(D_EXT_GYRO_BIAS_X,12,curr_dmp_gyro_bias);
	gyro_bias_cmp = memcmp(curr_dmp_gyro_bias,last_dmp_gyro_bias,12);
	if ( gyro_bias_cmp != 0 ) {
		changed = 1;
		memcpy(last_dmp_gyro_bias,curr_dmp_gyro_bias,12);
		for ( int i = 0; i < 3; i++ ) {
			/* Convert from big-endian to little-endian */
			dmpcaldata->gyro_bias_q16[i] = (int32_t)__REV(*((uint32_t *)&(curr_dmp_gyro_bias[i*sizeof(long)])));
		}
		dmpcaldata->mpu_temp_c = last_temperature / 65536.0;
	}
	return changed;
}

_EXTERN_ATTRIB int mpu_apply_dmp_gyro_biases(struct mpu_dmp_calibration_data *dmpcaldata) {
	uint8_t new_dmp_gyro_bias[12];
	for ( int i = 0; i < 3; i++ ) {
		/* Convert from little-endian to big-endian */
		*((uint32_t *)&(new_dmp_gyro_bias[i*sizeof(long)]))	 = __REV((uint32_t)dmpcaldata->gyro_bias_q16[i]);
	}
	mpu_write_mem(D_EXT_GYRO_BIAS_X,12,new_dmp_gyro_bias);
	return 0;
}

_EXTERN_ATTRIB int mpu_set_new_sample_rate( uint8_t new_sample_rate ) {
	long int mpl_rate_us = 1000000L / new_sample_rate;
	if (hal.dmp_on) {
        dmp_set_fifo_rate(new_sample_rate);
        inv_set_quat_sample_rate(mpl_rate_us);
    } else {
        mpu_set_sample_rate(new_sample_rate);
    }
    inv_set_gyro_sample_rate(mpl_rate_us);
    inv_set_accel_sample_rate(mpl_rate_us);
    return 0;
}

_EXTERN_ATTRIB bool mpu_detect()
{
	uint8_t address = 0x68;
	return ( HAL_I2C_IsDeviceReady(&hi2c2, address<<1, 3, 100) == HAL_OK );
}
